Revit 2027 API
MEPNetworkSegmentData.Flow Property
 The calculated flow of this segment, in ft^3/s. The positive value means the flow is from the start to the end node, the negative value means opposite direction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Flow { get; }
Public ReadOnly Property Flow As Double
	Get
public:
property double Flow {
	double get ();
}
member Flow : float with get
Property Value
Double
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace